
#include "appinc.h"

#define PR_ARRAY_SIZE(x)	(sizeof(x)/sizeof(x[0]))
static char s_ResponseCodeTable[][RESPONSE_CODE_LENGTH] =
{
	{'0', '0'},
	{'0', '1'},
	{'0', '3'},
	{'0', '4'},
	{'0', '5'},
	{'1', '0'},
	{'1', '1'},
	{'1', '2'},
	{'1', '3'},
	{'1', '4'},
	{'1', '5'},
	{'2', '1'},
	{'2', '2'},
	{'2', '5'},
	{'3', '0'},
	{'3', '1'},
	{'3', '4'},
	{'3', '8'},
	{'4', '0'},
	{'4', '1'},
	{'4', '3'},
	{'4', '5'},    
	{'5', '1'},
	{'5', '4'},
	{'5', '5'},
	{'5', '7'},
	{'5', '8'},
	{'5', '9'},
	{'6', '1'},
	{'6', '2'},
	{'6', '4'},
	{'6', '5'},
	{'6', '6'},
	{'6', '8'},
	{'7', '5'},
	{'9', '0'},
	{'9', '1'},
	{'9', '2'},
	{'9', '4'},
	{'9', '6'},
	{'9', '7'},
	{'9', '8'},
	{'9', '9'},
	{'A', '0'},
	{'A', '1'},
	{'A', '2'},
	{'A', '3'},
	{'A', '4'},
	{'A', '5'},
	{'A', '6'},
	{'A', '7'},
};

#define MAX_HINT_STRING_LENGTH	64
static PR_INT8 s_ResopnseCodeHints [][MAX_HINT_STRING_LENGTH]=
{
	"交易成功",
	"请持卡人与发卡银行联系",
	"无效商户",
	"此卡为无效卡(POS)",
	"持卡人认证失败",
	"交易成功但为部分承兑",
	"交易成功，VIP客户",
	"无效交易",
	"无效金额",
	"无效卡号",
	"此卡无对应发卡方",
	"该卡未初始化或睡眠卡",
	"操作有误，或超出交易允许天数",
	"无原始交易，请联系发卡行",
	"请重试",
	"此卡不能受理",
	"作弊卡，吞卡",
	"密码错误次数超限，请与发卡方联系",
	"发卡方不支持的交易类型",
	"挂失卡(POS)",
	"被窃卡(POS)",
	"请使用芯片",    
	"可用余额不足",
	"该卡已过期",
	"密码错",
	"不允许此卡交易",
	"发卡方不允许该卡在本终端进行此交易",
	"卡片校验错",
	"交易金额超限",
	"受限制的卡",
	"交易金额与原交易不匹配",
	"超出消费次数限制",
	"交易失败，请联系收单行或银联",
	"交易超时，请重试",
	"密码错误次数超限",
	"系统日切，请稍后重试",
	"发卡方状态不正常，请稍后重试",
	"发卡方线路异常，请稍后重试",
	"拒绝，重复交易，请稍后重试",
	"拒绝，交换中心异常，请稍后重试",
	"终端未登记",
	"发卡方超时",
	"PIN格式错,请重新签到",
	"MAC校验错,请重新签到",
	"转账货币不一致",
	"交易成功，请向资金转入行确认",
	"资金到账行账号不正确",
	"交易成功，请向资金到账行确认",
	"交易成功，请向资金到账行确认",
	"交易成功，请向资金到账行确认",
	"安全处理失败",
};

void GetResponseCodeHint(PR_INT8* theResponseCode, PR_INT8* theHint)
{
	PR_UINT32 hintIndex;

	for(hintIndex = 0; hintIndex < PR_ARRAY_SIZE(s_ResponseCodeTable); hintIndex++)
	{
		if (0==memcmp(s_ResponseCodeTable[hintIndex], theResponseCode, RESPONSE_CODE_LENGTH))
		{
			break;
		}
	}

	if (hintIndex==PR_ARRAY_SIZE(s_ResponseCodeTable))
	{
		// 找不到对应的响应码，直接提示“未知应答码”
		strcpy(theHint, "未知应答码");
	}
	else
	{
		strcpy(theHint, s_ResopnseCodeHints[hintIndex]);
	}
}

